index-0/libfe310/inc/fe310/periph/hw/aon.h
/* See LICENSE file for copyright and license details. */

#ifndef LIBFE310_PERIPH_HW_AON_H
#define LIBFE310_PERIPH_HW_AON_H

#include <fe310/bits.h>

#define AON_BASE 0x10000000

#define WDOG_CFG_SCALE GENMASK(3, 0)
#define WDOG_CFG_RSTEN BITMASK(8)
#define WDOG_CFG_ZEROCMP BITMASK(9)
#define WDOG_CFG_ENALWAYS BITMASK(12)
#define WDOG_CFG_COREAWAKE BITMASK(13)
#define WDOG_CFG_IP0 BITMASK(28)
// #define WDOG_COUNT
/* #define WDOG_S */
/* #define WDOG_FEED */
/* #define WDOG_KEY */
#define WDOG_CMP0_CMP0 GENMASK(15, 0)

#define RTC_CFG_SCALE GENMASK(3, 0)
#define RTC_CFG_ENALWAYS BITMASK(12)
#define RTC_CFG_IP0 BITMASK(28)
/* #define RTC_COUNTLO */
/* #define RTC_COUNTHI */
/* #define RTC_S */
/* #define RTC_CMP0 */

#define LFROSC_CFG_DIV GENMASK(5, 0)
#define LFROSC_CFG_TRIM GENMASK(20, 16)
#define LFROSC_CFG_EN BITMASK(30)
#define LFROSC_CFG_RDY BITMASK(31)

#define LFCLKMUX_LFEXTCLK_SEL BITMASK(0)
#define LFCLKMUX_LFEXTCLK_MUX_STATUS BITMASK(31)

/* #define AON_BACKUP_X */

#define PMU_IX_DELAY GENMASK(3, 0)
#define PMU_IX_PMU_OUT_0_EN BITMASK(4)
#define PMU_IX_PMU_OUT_1_EN BITMASK(5)
#define PMU_IX_CORERST BITMASK(7)
#define PMU_IX_HFCLKRST BITMASK(8)
#define PMU_IX_ISOLATE BITMASK(9)
#define PMU_IE GENMASK(2, 0)
#define PMU_CAUSE_WAKEUP GENMASK(1, 0)
#define PMU_CAUSE_RESET GENMASK(9, 8)

/* #define AON_SIFIVEBANDGAP */

#define AON_CFG_HAS_BANDGAP BITMASK(0)
#define AON_CFG_HAS_BOD BITMASK(1)
#define AON_CFG_HAS_LFROSC BITMASK(2)
#define AON_CFG_HAS_LFRCOSC BITMASK(3)
#define AON_CFG_HAS_LFXOSC BITMASK(4)
#define AON_CFG_HAS_POR BITMASK(5)
#define AON_CFG_HAS_LDO BITMASK(6)

#define WDOG_FOOD 0xD09F00D
#define WDOG_UNLOCK 0x051F15E
#define PMU_UNLOCK 0x051F15E

#endif /* LIBFE310_PERIPH_HW_AON_H */
